In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://Choonsik:ssafy0000@localhost:3306/sqld

In [4]:
%%sql

SELECT * FROM USER;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.

[(1, 'CHOONSIK', 'gumissafy00@gmail.com', None)]

In [6]:
%%sql

INSERT INTO USER (ID, NAME, EMAIL, AGE) VALUES (2, 'CHOONSIK', 'gumissafy00@gmail.com', 20);

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
1 rows affected.

[]

In [19]:
%%sql df <<

SELECT *
FROM USER;

 * mysql+pymysql://Choonsik:***@localhost:3306/sqld
2 rows affected.
Returning data to local variable df

In [22]:
import pandas as pd

df = pd.DataFrame(df)
df

   ID      NAME                  EMAIL   AGE
0   1  CHOONSIK  gumissafy00@gmail.com   NaN
1   2  CHOONSIK  gumissafy00@gmail.com  20.0